## Ashlee Alexander Task 2

## Task 1. Create DataFrame

In [5]:
import numpy as np

In [6]:
import pandas as pd

In [7]:
grades = pd.DataFrame({'wally':[87, 96, 70], 'Eva':[100, 87, 90], 'Sam':[94, 77, 90], 'Katie':[100, 81, 82], 'Bob':[83, 65, 85]})

In [8]:
grades

   wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

# Task 2 Custom Indices

In [9]:
grades.index = ["Test1", "Test2", "Test3"]

In [10]:
grades

       wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [12]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [16]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

# Task 3. Accessing Rows(loc, iloc)

In [14]:
grades.loc['Test1']

wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [15]:
grades.iloc[0]

wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [17]:
grades.iloc[0:2]

       wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

In [18]:
grades.loc['Test1':'Test3']

       wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

# Tast 3. Accessing Subsets (at, iat)

In [19]:
grades.at['Test2', 'Eva']

87

In [33]:
grades.iat[2,0]

70

# Task 4. Describe (By Column)

In [21]:
grades.describe()

           wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [34]:
pd.set_option("display.precision",2)

In [35]:
grades.describe()

       wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

# Task 5. Transpose (rows <--> Columns)

In [36]:
grades.mean()

wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

In [37]:
grades.T

       Test1  Test2  Test3
wally     87     96     70
Eva      100     87     90
Sam       94     77     90
Katie    100     81     82
Bob       83     65     85

In [38]:
grades.T.describe()

        Test1  Test2  Test3
count    5.00   5.00   5.00
mean    92.80  81.20  83.40
std      7.66  11.54   8.23
min     83.00  65.00  70.00
25%     87.00  77.00  82.00
50%     94.00  81.00  85.00
75%    100.00  87.00  90.00
max    100.00  96.00  90.00

# Task 6. Sort

In [39]:
grades.sort_index(ascending=False)

       wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96   87   77     81   65
Test1     87  100   94    100   83

In [40]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  wally
Test1   83  100    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70